# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install CLI Tools
## Shell Utilities
brew 'ack'
brew 'autojump'
brew 'coreutils'
brew 'docker-compose'
brew 'jq'
brew 'tmux'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

## Network Utilities
brew 'htop'
brew 'mtr'
brew 'netcat' #Networking utility for the TCP/IP protocol.
brew 'nmap'
brew 'wget'

## System Utilities
brew 'mackup'
brew 'mas'
brew 'ncdu'
brew 'trash'
brew 'tree'
brew 'watch'

## Dev Utilities
brew 'awscli'
brew 'diff-so-fancy'
brew 'git'
brew 'node'
brew 'w3m'
brew 'macvim'

# Mac Apps
## Browsers
cask 'google-chrome'
cask 'google-chrome-canary'

## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'alfred'
cask 'cheatsheet'
cask 'clipy'
cask 'docker'
brew 'docker-compose'
brew 'docker-machine'
cask 'go2shell'
cask 'keycastr'
cask 'rectangle'

## System
cask 'ccleaner'
cask 'coconutbattery'
cask 'namechanger'

## Editor
cask 'macdown'

## Development
cask 'diffmerge'
cask 'gas-mask'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'robo-3t'
cask 'sequel-pro'
cask 'shuttle'

## Multimedia
cask 'aerial'
cask 'handbrake'
cask 'mixxx'

# Finder Quicklook
# https://github.com/sindresorhus/quick-look-plugins
# http://www.quicklookplugins.com/
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-csv' #++
cask 'jupyter-notebook-ql' #++

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Gapplin', id: 768053424
mas 'Giphy Capture', id: 668208984
mas 'JSON Helper for AppleScript', id: 453114608
mas 'Location Helper for AppleScript', id: 488536386
