# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install CLI Tools
## Shell Utilities
brew 'ack'
brew 'autojump'
brew 'coreutils'
brew 'docker-compose'
brew 'findutils'
brew 'jq'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

## Network Utilities
brew 'htop'
brew 'mtr'
brew 'netcat' #Networking utility for the TCP/IP protocol.
brew 'nmap'
brew 'wget'
brew 'nginx'

## System Utilities
brew 'archey'
brew 'mackup'
brew 'mas'
brew 'ncdu'
brew 'terminal-notifier'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'watch'

## Multimedia
brew 'graphicsmagick'

## Dev Utilities
brew 'awscli'
brew 'diff-so-fancy'
brew 'git'
brew 'heroku-toolbelt'
brew 'node'
brew 'w3m'
brew 'macvim'

## Other
## Fish shell.
# brew 'fish'
# Mobile Shell (MOSH) is like SSH plus roaming and smart echo.
# brew 'mosh'

# Mac Apps
## Entertainment
cask 'spotify'
cask 'vlc'

## Browsers
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'opera'

## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'alfred'
cask 'cheatsheet'
cask 'clipy'
cask 'docker'
brew 'docker-compose'
brew 'docker-machine'
cask 'go2shell'
cask 'keycastr'
cask 'lastpass'
cask 'spectacle'

## System
cask 'appcleaner'
cask 'ccleaner'
cask 'coconutbattery'
cask 'flux'
cask 'namechanger'
cask 'omnidisksweeper'

## Editor
cask 'sublime-text'
cask 'macdown'

## Services
cask 'mongodb'

## Development
cask 'diffmerge'
cask 'gas-mask'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'microsoft-remote-desktop-beta'
cask 'ngrok'
cask 'robo-3t'
cask 'sequel-pro'
cask 'shuttle'
cask 'vagrant'
cask 'virtualbox'

## Multimedia
cask 'mkchromecast'
cask 'satellite-eyes'
cask 'aerial'
cask 'handbrake'
cask 'vlc'
cask 'mixxx'
cask 'igetter'

# Finder Quicklook
# https://github.com/sindresorhus/quick-look-plugins
# http://www.quicklookplugins.com/
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
cask 'provisionql'
cask 'quicklookapk'
cask 'quicklook-csv' #++
cask 'jupyter-notebook-ql' #++

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Gapplin', id: 768053424
mas 'Giphy Capture', id: 668208984
mas 'JSON Helper for AppleScript', id: 453114608
mas 'Location Helper for AppleScript', id: 488536386
