# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install CLI Tools
## Shell Utilities
brew 'coreutils'
brew 'findutils'
brew 'homebrew/dupes/grep'
brew 'autojump'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'docker-compose'
brew 'ack'
brew 'ripgrep'

## Network Utilities
brew 'htop'
brew 'nmap'
brew 'mtr'
brew 'wget'

## System Utilities
brew 'archey'
brew 'terminal-notifier'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'

## Dev Utilities
brew 'diff-so-fancy'
brew 'heroku-toolbelt'
brew 'git'
brew 'awscli'
brew 'w3m'
brew 'node'

# Mac Apps
## Communication
cask 'slack'
cask 'skype'

## Productivity
cask 'alfred'
cask 'docker'
cask 'google-chrome'
cask 'spectacle'
cask 'rdm'
cask 'keycastr'
cask 'clipy'
cask 'cheatsheet'

## System
cask 'coconutbattery'
cask 'appcleaner'
cask 'ccleaner'
cask 'namechanger'
cask 'omnidisksweeper'

## Editor
cask 'sublime-text'
cask 'macdown'

## Development
cask 'gas-mask'
cask 'firefox'
cask 'imageoptim'
cask 'iterm2'
cask 'shuttle'
cask 'reattach-to-user-namespace'
cask 'sequel-pro'
cask 'robomongo'
cask 'diffmerge'
cask 'gpgtools'

## Multimedia
cask 'chromecast'
cask 'satellite-eyes'
cask 'aerial'
cask 'handbrake'
cask 'vlc'
cask 'mixxx'
cask 'igetter'

# Finder Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'webpquicklook'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Byword', id: 420212497
mas 'Deckset', id: 847496013
mas 'Gapplin', id: 768053424
mas 'Sip', id: 507257563
mas 'Giphy Capture', id: 668208984
mas 'Tweetbot', id: 557168941
